from openai import OpenAI

CLIENT = OpenAI(api_key="sk-proj-mmRKHjeDcfL9vQxDezi4T3BlbkFJKXL7oAEiuxFsU8ZC9xVs")

PROMPT = ("Перефразуй останнє повідомлення користувача заповнюючи контекстуальні пробіли.\n"
          "Приклад 1:\n"
          "Вхідна розмова:\n"
          "user: На якій вулиці знаходиться ВПУ№29\n"
          "assistant: На вулиці Шевченка 112\n"
          "user: Хто зараз директор цього ВПУ?\n"
          "Результат:\n"
          "Хто зараз є директор ВПУ№29?\n"
        "Приклад 2:\n"
          "Вхідна розмова:\n"
          "user: Хочу купити круаса\n"
          "assistant: Круто, які круасани тебе цікавлять?\n"
          "user: хочу амстердам\n"
          "Результат:\n"
          "Хочу придбати круасан амстердам\n"
          "Приклад 3:\n"


        )

chat_history = [
    {
        'role': 'system',
        'content': 'Ти віртуальний асистент Вищого професійного училища №29 м.Львова, який допомагає учням або вступникам'
                   'Дізнатися новини училища, вступити до училища, професії які можна здобути в училищі, дізнатися які'
                   'потрібні документи до вступу, правила прийому, історія училища, НПЦ Автомобільного транспорт, НПЦ Перукарське мистецтво'
                   'НПЦ Інформаційних та цифрових технологій, також коли будеш просити користувача надати якісь документи'
                   'завжди проси їх залити на imgur та надати тобі посилання з цього сайту. Будь доброю та веселою, завжди жартуй. Ти сова і твоє ім\'я'
                   'Амалія. Твоя відповідь повинна бути до 70 слів'
    },
    {
        'role': 'user',
        'content': 'Які є професії у ВПУ№29'
    },
    {
        'role': 'assistant',
        'content': '🖋«Слюсар з ремонту колісних транспортних засобів, Електрозварник ручного зварювання, \n'
          'Водій автотранспортних засобів (категорії «В», «С»)» 🖋«Слюсар з ремонту колісних транспортних засобів» \n'
          '🖋«Оператор з обробки інформації та програмного забезпечення» \n'
          '🖋«Кухар, Офіціант» 🖋«Кухар, Кондитер» 🖋«Кухар, Бармен» 🖋«Перукар (перукар-модельєр), Манікюрник» 🖋«Перукар (перукар-модельєр), \n'
          'Візажист» 🖋«Перукар (перукар-модельєр)» 🖋«Майстер з діагностики та налагодження електронного устаткування автомобільних засобів»'
    },
    {
        'role': 'user',
        'content': 'Розкажи більше про 3 спеціальність'
    },
]





def get_context_message(chat_history):
    prompt = PROMPT
    for message in chat_history:
        if message['role'] == 'system':
            continue
        else:
            prompt += f"{message['role']}: {message['content']}\n"

    prompt += "Результат:"
    response = CLIENT.chat.completions.create(
        model="gpt-3.5-turbo",
        messages=[{
            'role': 'system',
            'content': prompt
        }])
    print(response.choices[-1].message.content)
    return response.choices[-1].message.content
